In [3]:
!pip install cx_oracle

Defaulting to user installation because normal site-packages is not writeable
Collecting cx_oracle
  Downloading cx_Oracle-8.3.0-cp39-cp39-win_amd64.whl (213 kB)
     -------------------------------------- 213.2/213.2 kB 4.3 MB/s eta 0:00:00
Installing collected packages: cx_oracle
Successfully installed cx_oracle-8.3.0

[notice] A new release of pip available: 22.2 -> 22.2.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import cx_Oracle
import pandas as pd

db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
# 사용자명, 비밀번호, 호스트이름:포트/서비스이름
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
df.head()

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000
3  4   골프 바이블  대한미디어  35000
4  5    피겨 교본   굿스포츠   8000

In [3]:
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from BOOK")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

   BOOKID BOOKNAME PUBLISHER  PRICE
0       1   축구의 역사      굿스포츠   7000
1       2  축구아는 여자       나무수  13000
2       3   축구의 이해     대한미디어  22000
3       4   골프 바이블     대한미디어  35000
4       5    피겨 교본      굿스포츠   8000

In [4]:
col

[('BOOKID',), ('BOOKNAME',), ('PUBLISHER',), ('PRICE',)]

In [5]:
col_new = []
for i in col:
    for j in i:
        col_new.append(j)
col_new

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [6]:
cursor.close()
db.close()

#### Q. hr 사용자를 적용하면 원하는 테이블을 가져와서 df로 출력하세요(컬럼명 포함)

In [16]:
db = cx_Oracle.connect("c##hr", "hr", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from EMPLOYEES")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'EMPLOYEES'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [17]:
cursor.close()
db.close()

In [10]:
# create 흠 이거 말고
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cs = db.cursor()
sql = "create table sample1(id varchar2(10), score number)"
cs.execute(sql)
cs.close()
db.commit()
db.close()

In [ ]:
# insert 이거 말고
def insert(t):
    db = cx_oracle.connect("c##madang", "madang", "localhost:1521/xe")
    cs = db.cursor()
    sql = "insert into sample1 (col01,col02) values (:1,:2)"
    # executemany <- many 써야 여러개 가능함
    cs.executemany(sql, t)
    cs.close()
    db.commit()
    db.close()
    
insert(('9','1'))

In [18]:
# create, insert
db = cx_Oracle.connect("c##madang", "madang", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("create table sample2(id number)")
cursor.execute("insert into sample2(id) values(1)")
db.commit()

In [19]:
# lmembers - DEMO table 가져오기
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from DEMO")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'DEMO'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  CUSTNO GENDER    AGE AREA
0  00501      F  60세이상  460
1  00502      F  60세이상  060
2  00503      F  60세이상  055
3  00504      F  60세이상  049
4  00505      F  60세이상  055

In [21]:
df.shape

(19383, 4)

In [22]:
df.AGE.value_counts()

45세~49세    4082
40세~44세    3677
50세~54세    3114
35세~39세    2769
55세~59세    1774
30세~34세    1679
60세이상      1303
25세~29세     685
20세~24세     283
19세이하        17
Name: AGE, dtype: int64

In [23]:
cursor.close()
db.close()

In [24]:
# lmembers - DEMO table 가져오기
db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PRODCL")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PRODCL'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

  ASSO  BCODE MCODE    SCODE    MCL      SCL
0    A      4  0409  A040902   디자이너   디자이너부틱
1    A      4  0409  A040903   디자이너  디자이너캐릭터
2    A      4  0410  A041001  모피/피혁       모피
3    A      4  0410  A041002  모피/피혁       피혁
4    A      4  0410  A041003  모피/피혁   숙녀고정행사

In [26]:
df.BCODE.value_counts()

17    306
5     288
6     240
1     236
4     232
     ...
89      6
59      6
61      5
58      4
60      1
Name: BCODE, Length: 92, dtype: int64

In [27]:
df.BCODE.unique()

array([ 4,  5,  6,  7,  8,  9,  1,  2,  3, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25,
       57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85,
       86, 87, 88, 89, 90, 91, 92], dtype=int64)

#### 과제_1012_1 PURPRD 테이블을 가져와서 다음사항을 수행하세요
- pivot_table을 이용해서 고객번호별 대분류(상품)별 구매금액을 도출
- 고객별 구매관련 의미있는 인사이트를 뽑아낼 수 있는 데이터 셋을 출력(2개 이상)

In [4]:
# lmembers - PURPRD table 가져오기

import cx_Oracle
import pandas as pd

db = cx_Oracle.connect("c##cakd7", "cakd7", "localhost:1521/xe")
cursor = db.cursor()
cursor.execute("select * from PURPRD")
x = cursor.fetchall()
df = pd.DataFrame(x)
cursor.execute("""select column_name from user_tab_columns where table_name = 'PURPRD'""")
col = cursor.fetchall()
col_new = [j for i in col for j in i]
df.columns = col_new
df.head()

MemoryError: